OF2/data/part9-1/system/sample
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sample;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type sets;
libs            ("libsampling.so");

interpolationScheme cell;

setFormat       raw;

writeControl    writeTime; // this ensures that it's writing only at writeInterval

sets
(

    // make sure to change (x1 y1 z1) and (x2 y2 z2) to
    // the coordinates of the start and end points

    pi4 
    {
        type    lineCell;
        axis    xyz;
        start   (0.35355339059327 0.35355339059327 0);
        end     (2.47487373415289 2.47487373415289 0);
    }

    pi2
    {
        type    lineCell;
        axis    xyz;
        start   (0 0.5 0);
        end     (0 3.5 0);
    }


    threepi4 
    {
        type    lineCell;
        axis    xyz;
        start   (-0.35355339059327 0.35355339059327 0);
        end     (-2.47487373415289 2.47487373415289 0);
    }

    L 
    {
        type    lineCell;
        axis    xyz;
        start   (0 0 0);
        end     (8.0 0 0);
    }
);

fields          ( p U );


// ************************************************************************* //
